balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F5015.PIC
        <edc:SFRDef edc:access="----nnnn------nn" edc:cname="PWMCON2" edc:desc="" edc:impl="0xf03" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000------00" edc:name="PWMCON2" edc:nzwidth="0x10" edc:por="----0000------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UDIS" edc:desc="" edc:mask="0x1" edc:name="UDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSYNC" edc:desc="" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IUE" edc:desc="" edc:mask="0x1" edc:name="IUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="SEVOPS" edc:desc="" edc:mask="0xf" edc:name="SEVOPS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="SEVOPS0" edc:desc="" edc:mask="0x1" edc:name="SEVOPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS1" edc:desc="" edc:mask="0x1" edc:name="SEVOPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS2" edc:desc="" edc:mask="0x1" edc:name="SEVOPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS3" edc:desc="" edc:mask="0x1" edc:name="SEVOPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DTCON1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DTCON1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTA" edc:desc="" edc:mask="0x3f" edc:name="DTA" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTAPS" edc:desc="" edc:mask="0x3" edc:name="DTAPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DTB" edc:desc="" edc:mask="0x3f" edc:name="DTB" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTBPS" edc:desc="" edc:mask="0x3" edc:name="DTBPS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DTA0" edc:desc="" edc:mask="0x1" edc:name="DTA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA1" edc:desc="" edc:mask="0x1" edc:name="DTA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA2" edc:desc="" edc:mask="0x1" edc:name="DTA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA3" edc:desc="" edc:mask="0x1" edc:name="DTA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA4" edc:desc="" edc:mask="0x1" edc:name="DTA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA5" edc:desc="" edc:mask="0x1" edc:name="DTA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTAPS0" edc:desc="" edc:mask="0x1" edc:name="DTAPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTAPS1" edc:desc="" edc:mask="0x1" edc:name="DTAPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTB0" edc:desc="" edc:mask="0x1" edc:name="DTB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTB1" edc:desc="" edc:mask="0x1" edc:name="DTB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTB2" edc:desc="" edc:mask="0x1" edc:name="DTB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTB3" edc:desc="" edc:mask="0x1" edc:name="DTB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTB4" edc:desc="" edc:mask="0x1" edc:name="DTB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTB5" edc:desc="" edc:mask="0x1" edc:name="DTB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTBPS0" edc:desc="" edc:mask="0x1" edc:name="DTBPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTBPS1" edc:desc="" edc:mask="0x1" edc:name="DTBPS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="DTCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="DTCON2" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTS1I" edc:desc="" edc:mask="0x1" edc:name="DTS1I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS1A" edc:desc="" edc:mask="0x1" edc:name="DTS1A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS2I" edc:desc="" edc:mask="0x1" edc:name="DTS2I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS2A" edc:desc="" edc:mask="0x1" edc:name="DTS2A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS3I" edc:desc="" edc:mask="0x1" edc:name="DTS3I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS3A" edc:desc="" edc:mask="0x1" edc:name="DTS3A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS4I" edc:desc="" edc:mask="0x1" edc:name="DTS4I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS4A" edc:desc="" edc:mask="0x1" edc:name="DTS4A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnn---nnnn" edc:cname="FLTACON" edc:desc="" edc:impl="0xff8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000---0000" edc:name="FLTACON" edc:nzwidth="0x10" edc:por="000000000---0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FAEN1" edc:desc="" edc:mask="0x1" edc:name="FAEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAEN2" edc:desc="" edc:mask="0x1" edc:name="FAEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAEN3" edc:desc="" edc:mask="0x1" edc:name="FAEN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAEN4" edc:desc="" edc:mask="0x1" edc:name="FAEN4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="FLTAM" edc:desc="" edc:mask="0x1" edc:name="FLTAM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1L" edc:desc="" edc:mask="0x1" edc:name="FAOV1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1H" edc:desc="" edc:mask="0x1" edc:name="FAOV1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV2L" edc:desc="" edc:mask="0x1" edc:name="FAOV2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV2H" edc:desc="" edc:mask="0x1" edc:name="FAOV2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV3L" edc:desc="" edc:mask="0x1" edc:name="FAOV3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV3H" edc:desc="" edc:mask="0x1" edc:name="FAOV3H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV4L" edc:desc="" edc:mask="0x1" edc:name="FAOV4L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV4H" edc:desc="" edc:mask="0x1" edc:name="FAOV4H" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnn---nnnn" edc:cname="FLTBCON" edc:desc="" edc:impl="0xff8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000---0000" edc:name="FLTBCON" edc:nzwidth="0x10" edc:por="000000000---0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FBEN1" edc:desc="" edc:mask="0x1" edc:name="FBEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBEN2" edc:desc="" edc:mask="0x1" edc:name="FBEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBEN3" edc:desc="" edc:mask="0x1" edc:name="FBEN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBEN4" edc:desc="" edc:mask="0x1" edc:name="FBEN4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="FLTBM" edc:desc="" edc:mask="0x1" edc:name="FLTBM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV1L" edc:desc="" edc:mask="0x1" edc:name="FBOV1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV1H" edc:desc="" edc:mask="0x1" edc:name="FBOV1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV2L" edc:desc="" edc:mask="0x1" edc:name="FBOV2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV2H" edc:desc="" edc:mask="0x1" edc:name="FBOV2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV3L" edc:desc="" edc:mask="0x1" edc:name="FBOV3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV3H" edc:desc="" edc:mask="0x1" edc:name="FBOV3H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV4L" edc:desc="" edc:mask="0x1" edc:name="FBOV4L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV4H" edc:desc="" edc:mask="0x1" edc:name="FBOV4H" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
